A622266/micropython/ports/mimxrt/machine_spi.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2020-2021 Damien P. George
 * Copyright (c) 2021 Robert Hammelrath
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include <string.h>

#include "py/runtime.h"
#include "py/mphal.h"
#include "py/mperrno.h"
#include "extmod/modmachine.h"
#include CLOCK_CONFIG_H

#include "fsl_cache.h"
#include "fsl_dmamux.h"
#include "fsl_iomuxc.h"
#include "fsl_lpspi.h"
#include "fsl_lpspi_edma.h"
#include "fsl_pit.h"
#include "fsl_xbara.h"
#include "dma_manager.h"

// --- Periodic DMA transfer extension (SPI.dma_periodic_start() and friends) ---
//
// Added to drive a fixed-rate register update (e.g. a DDS phase/frequency tuning word)
// with hardware timing, independent of CPU polling -- ordinary machine.SPI.write() here
// calls LPSPI_MasterTransferBlocking() (see machine_spi_transfer() below), a fully
// synchronous, CPU-blocking call with no DMA involvement at all; measured sustained
// throughput for that path was ~2000Hz when interleaved with real-time audio I2S, far
// short of a 192kHz per-sample DDS update target. See this project's own memory/design
// notes (not reproduced here) for the fuller rationale; this comment covers only the
// verified hardware facts this implementation depends on.
//
// Verified against the actual vendored SDK/device headers for this chip (i.MX RT1062),
// not assumed:
//   - PIT and GPT have NO entry in the dma_request_source_t enum
//     (sdk/devices/MIMXRT1062/MIMXRT1062.h) -- neither can trigger DMAMUX directly.
//   - An EARLIER version of this file used Quad Timer (QTMR2)'s "Comparator Preload"
//     DMA request for the trigger. Bench-tested 2026-09-06 and found NOT to work: that
//     mechanism is tied to the CMPLD1->COMP1 double-buffered reload feature (a
//     producer/consumer relationship for auto-refreshing a compare value via DMA), not a
//     bare "period elapsed" pulse -- confirmed via a dedicated ISR-count diagnostic
//     (spi_dma_isr_count(), kept in this file -- see dma_periodic_isr_count() below)
//     showing zero interrupts over a 30s run despite the DDS output looking stable (that
//     stability was just the initial blocking-write priming value, latched and held by
//     the chip, never actually refreshed by DMA). Use the same counter to confirm PIT's
//     interrupt actually reaches this callback before trusting this replacement either.
//   - Replaced with PIT + XBARA1 (2026-09-06), then replaced AGAIN (2026-09-07) with
//     PIT's dedicated DMAMUX periodic-trigger path -- see SPI_DMA_DMAMUX_CHANNEL's own
//     comment below for the full story (bench-confirmed multi-frame-per-trigger bug in
//     the XBARA1 version, and the i.MX RT1060 Reference Manual section that documents
//     the mechanism actually used now). PIT_StartTimer()'s own doc comment
//     (sdk/drivers/pit/fsl_pit.h) says a channel "generates a trigger pulse" every time
//     it reaches 0, unconditionally -- no compare/capture/reload complexity, this is
//     PIT's entire purpose, and remains true regardless of which downstream routing
//     (XBARA1 vs. DMAMUX's native per-channel PIT pairing) consumes that pulse.
//   - I/O_UPDATE (2026-09-06, REVISED -- see below): originally generated by TMR3
//     channel 3's hardware PWM on pin D15 (native alt-function mux
//     IOMUXC_GPIO_AD_B1_03_QTIMER3_TIMER3). Bench-tested with a digital logic capture
//     (ADALM2000, SCK/UPD/MOSI/CS) and found to genuinely DRIFT relative to the
//     PIT-sourced SPI trigger: every I/O_UPDATE rising edge landed at a different,
//     cyclically-repeating percentage through the CS-low window (28%, 78%, 97%, 14%, ...)
//     -- a real beat frequency, not a fixed offset needing one calibration. Root cause:
//     PIT is clocked from PERCLK (CLOCK_GetPerClkFreq()) while QTMR is clocked from
//     IPG_CLK (CLOCK_GetFreq(kCLOCK_IpgClk)) -- two independent, non-phase-locked clock
//     roots, so no amount of one-time phase tuning holds over time.
//   - FIXED by deriving I/O_UPDATE from PIT's OWN clock domain instead: two more PIT
//     channels (SPI_DMA_IO_UPDATE_RISE_PIT_CHANNEL, SPI_DMA_IO_UPDATE_FALL_PIT_CHANNEL),
//     same PERCLK root as the SPI trigger channel, each routed through its own XBARA1
//     input/output pair into its own small self-linked eDMA channel that writes a single
//     constant 32-bit bitmask directly to GPIO1's write-only DR_SET (rising edge) or
//     DR_CLEAR (falling edge) register for pin D15 (SoC pad GPIO_AD_B1_03 = GPIO1 bit 19,
//     confirmed via IOMUXC_GPIO_AD_B1_03_GPIO1_IO19 and the GPIO_Type layout in
//     MIMXRT1062.h -- DR_SET/DR_CLEAR/DR_TOGGLE are the atomic, write-only,
//     read-modify-write-free bitmask registers this chip provides specifically so
//     software/DMA can set/clear individual pins without touching others). D15 is
//     therefore now plain GPIO output (IOMUXC_GPIO_AD_B1_03_GPIO1_IO19), not
//     QTIMER3_TIMER3 -- TMR3 is no longer used anywhere in this file.
//   - The fixed phase offset between PIT channel 0 (SPI trigger) and channels 1/2
//     (I/O_UPDATE rise/fall) is created with a one-time trick, not a running
//     calibration: PIT_SetTimerPeriod() writes LDVAL, and per fsl_pit.h's own
//     PIT_StartTimer()/PIT_SetTimerPeriod() doc comments, a channel only reloads CVAL
//     from LDVAL when it reaches 0 -- writing a new LDVAL while a channel is already
//     counting does not disturb the in-flight countdown. So each offset channel is
//     started with a short, one-shot LDVAL equal to its desired offset (in PIT ticks
//     from a shared t=0), then its LDVAL is immediately rewritten to the full period --
//     that only takes effect on the SECOND and subsequent reloads, leaving the channel
//     forever after firing at (offset, offset+period, offset+2*period, ...) relative to
//     channel 0's own (period, 2*period, ...), with zero drift since all three channels
//     share the identical PERCLK root by construction. The only skew is the handful of
//     CPU cycles between the three PIT_StartTimer() calls in dma_periodic_start() below
//     -- fixed at start time, not accumulating, and far smaller than one PERCLK tick's
//     worth of the datasheet's I/O_UPDATE setup/hold budget.
//   - LPSPI's own automatic FIFO-empty DMA request (its DER.TDDE bit) -- REVISED
//     2026-09-07, now DELIBERATELY ENABLED, reversing the earlier "deliberately NOT
//     used" note this comment used to carry. That earlier note was based on an
//     assumption, not a bench check: that DER.TDDE would be "paced by the SPI baud
//     rate, not by the PIT-sourced trigger, so the two must not both drive the same
//     DMAMUX channel." The i.MX RT1060 Reference Manual (section 5.4.1) says the
//     opposite is the INTENDED design: the peripheral's own continuous "I want data"
//     request is exactly what the DMAMUX periodic-trigger feature is built to gate, and
//     its own worked example is literally an SPI transmit channel triggered this way.
//     Bench-confirmed (2026-09-07): with DER.TDDE left at its reset default (0, verified
//     via register readback) and the SPI trigger instead faked out of XBARA1's edge-
//     detect output (the OLD mechanism), writing a >1-byte minor loop caused MULTIPLE
//     frames to fire per single PIT period instead of one (see SPI_DMA_DMAMUX_CHANNEL's
//     comment for the full isolation). The caller must still choose a baudrate high
//     enough that one frame's clock-out time stays comfortably under one rate_hz period
//     (e.g. a 9-byte AD9910 Profile-0 write is 72 bits; at 192kHz that leaves ~5.2us, so
//     a >=20Mbps baudrate is needed for real margin) -- the DMAMUX gate gives correct
//     COUNT (one minor loop per trigger), not a guarantee that a too-slow baudrate won't
//     still be running when the next trigger arrives.
//
// NOT yet verified -- real open items, deliberately left as runtime-computed or
// explicit caller-supplied values rather than guessed constants:
//   - The exact PIT channel-0 tick count for a given rate_hz: computed at
//     spi_dma_periodic_start() time from CLOCK_GetPerClkFreq(), the accessor this SDK
//     provides specifically for PIT's own clock root, not hardcoded. NOT yet bench-
//     confirmed that PIT's trigger actually reaches the eDMA channel end to end (that's
//     the immediate next thing to verify, after QTMR2's mechanism turned out not to).
//   - I/O_UPDATE pulse width/phase relative to the SPI frame's completion -- exposed as
//     explicit io_update_duty_u16/io_update_phase_ticks arguments rather than a default,
//     because getting this wrong either misses the datasheet's I/O_UPDATE setup/hold
//     window or clips into the next frame; needs ADALM2000 bench measurement. The DRIFT
//     problem itself is now architecturally fixed (both channels share PIT's clock --
//     see the revised bullet above), but the specific NUMBER of ticks that lands safely
//     after a frame completes is still a bench-measured quantity, not derived here.
//   - Whether PIT channels 0-2, XBARA1 outputs 0-2, and two extra eDMA channels are free
//     at runtime on top of whatever else the running firmware claims (this file does not
//     check for conflicts with other code that might already be using them -- a real
//     gap, not yet handled).
//   - D-cache coherency around the ring buffer (RESOLVED 2026-09-06): a frequency-sweep
//     bench test found this exact gap for real -- dma_periodic_write() calls succeeded
//     and produced genuinely varying content (confirmed via the Teensy's own debug log),
//     but the DDS output never changed, stuck on whatever the first write left in RAM.
//     Fixed by adding DCACHE_CleanByRange() after both the initial memset() in
//     dma_periodic_start() and every memcpy() in dma_periodic_write(). Re-verify the
//     sweep test again with this fix before considering it fully closed.
//   - Multi-byte frame bit-ordering on the wire, end to end. dma_periodic_start() widens
//     LPSPI's TCR.FRAMESZ so hardware holds chip-select low across a whole
//     instruction-byte+payload frame instead of toggling it every byte (see that
//     function's own comment for why this is a read-modify-write with a real
//     precondition, not a from-scratch TCR reconstruction) -- but nobody has yet
//     compared a byte captured off this DMA path against a known-good blocking-mode
//     write of the same register on a logic analyzer. Do not trust this produces a
//     correct AD9910/9952/9954 register write until that comparison has been done.

#define DEFAULT_SPI_ID          (0)
#define DEFAULT_SPI_BAUDRATE    (1000000)
#define DEFAULT_SPI_POLARITY    (0)
#define DEFAULT_SPI_PHASE       (0)
#define DEFAULT_SPI_BITS        (8)
#define DEFAULT_SPI_FIRSTBIT    (kLPSPI_MsbFirst)
#define DEFAULT_SPI_DRIVE       (6)

