A622266/micropython/ports/mimxrt/machine_spi.c
#define CLOCK_DIVIDER           (1)

#if defined(MIMXRT117x_SERIES)
#define LPSPI_DMAMUX            DMAMUX0
#else
#define LPSPI_DMAMUX            DMAMUX
#endif

#define MICROPY_HW_SPI_NUM MP_ARRAY_SIZE(spi_index_table)

#define SCK (iomux_table[index])
#define CS0 (iomux_table[index + 1])
#define SDO (iomux_table[index + 2])
#define SDI (iomux_table[index + 3])
#define CS1 (iomux_table[index + 4])

// PIT channel 0 is dedicated as the periodic-DMA trigger for ALL SPI(id) objects that
// use dma_periodic_start() -- this project only ever needs one such stream at a time
// (the DDS phase path), so no per-instance allocation is implemented. PIT channels 1 and
// 2 are dedicated as the I/O_UPDATE rise/fall generators (see the module-level comment
// above for why this replaced TMR3's PWM -- clock-domain drift between PIT/PERCLK and
// QTMR/IPG_CLK, confirmed on the bench).
// Trigger mechanism (2026-09-06, revised): NOT QTMR2 anymore -- bench-tested and found
// that QTMR's "Comparator Preload" DMA request is tied to the CMPLD1->COMP1 double-
// buffered reload mechanism (a producer/consumer relationship for auto-updating a
// compare value via DMA), not a bare "period elapsed" pulse; nothing ever primed
// CMPLD1, so the request never fired (confirmed via a dedicated ISR-count diagnostic:
// zero interrupts over a 30s run despite the DDS output looking stable -- that stability
// was just the initial blocking-write priming value, latched and held, never actually
// refreshed by DMA).
//
// Replaced with PIT + XBARA1, verified against the device header (not assumed):
// PIT_StartTimer()'s own doc says a channel "generates a trigger pulse" unconditionally
// every time it reaches 0 -- no compare/capture/reload complexity attached, this is
// PIT's entire purpose. That trigger has no direct DMAMUX entry (confirmed earlier --
// PIT and GPT are both absent from dma_request_source_t), but XBARA1 has a dedicated
// input for it (kXBARA1_InputPitTrigger0, MIMXRT1062.h) which can be routed to one of
// XBARA1's 4 DMAMUX-facing outputs (kXBARA1_OutputDmaChMuxReq30, matching DMAMUX's own
// kDmaRequestMuxXBAR1Request0 -- confirmed these are the same physical signal by cross-
// referencing the request-number in both enums' comments). PIT channel 0, XBARA1 output
// 0 chosen; nothing else in this codebase uses either.
// SPI trigger mechanism (2026-09-07, REVISED -- see the module-level comment above):
// NOT XBARA1-routed anymore. Reference manual research (i.MX RT1060 RM rev.2, section
// 5.4.1 "DMA channels with periodic triggering capability") found the ACTUAL documented
// mechanism for this exact use case -- literally its own worked example is "the transmit
// side of an SPI is assigned to a DMA channel with a trigger... the SPI transfers can be
// automatically performed every 5us" -- and it is NOT what this file used to do. Only
// the FIRST 4 DMAMUX channels have this periodic-triggering capability (CHCFG[TRIG]),
// and each is hardwired 1:1 to a specific PIT channel (RM Table 4-4: eDMA channel N <->
// PIT channel N) -- not an arbitrary XBARA-routed pairing. The trigger GATES the
// peripheral's OWN continuous DMA request (LPSPI's DER.TDDE, "transmit FIFO not full"),
// servicing exactly one minor loop per trigger and then re-closing the gate until the
// peripheral re-requests AND the next trigger arrives (RM Figure 5-3). The XBARA1-routed
// version instead faked a request source out of XBARA1's edge-detect output, which does
// not self-negate the way the RM's gating model requires a peripheral's request to --
// bench-confirmed (2026-09-07) to cause multiple minor loops to fire per single PIT
// period once frame_bytes > 1 (empirically isolated: frame_bytes=1 gated perfectly at
// exactly the configured rate; frame_bytes=4 produced 4 frames/trigger; frame_bytes=9
// produced 3 frames/trigger -- all while PIT's own LDVAL/CVAL registers read back
// correctly configured, and LPSPI's DER read back 0/disabled, ruling out both of those
// as the cause). DMAMUX channel 0 is used directly (bypassing allocate_dma_channel() --
// this is a fixed, dedicated hardware feature restricted to channels 0-3, not a
// general-purpose allocation, and dma_manager.c's channel_list already reserves 0-3),
// paired with PIT channel 0 per the RM's fixed table -- which happens to already be
// SPI_DMA_PIT_CHANNEL below, so no PIT channel renumbering was needed, only the DMAMUX
// routing changed.
#define SPI_DMA_PIT_CHANNEL         kPIT_Chnl_0
#define SPI_DMA_DMAMUX_CHANNEL      (0u)
#define SPI_DMA_LPSPI4_TX_DMAMUX_SRC kDmaRequestMuxLPSPI4Tx

// I/O_UPDATE rise/fall: two more PIT channels, same PERCLK root as SPI_DMA_PIT_CHANNEL
// above, each routed through its own XBARA1 input/output pair to its own small eDMA
// channel that toggles pin D15 (GPIO1 bit 19) directly via GPIO1's DR_SET/DR_CLEAR
// registers. See the module-level comment for why this replaced TMR3's PWM and how the
// fixed phase offset between these and SPI_DMA_PIT_CHANNEL is created.
#define SPI_DMA_IO_UPDATE_RISE_PIT_CHANNEL   kPIT_Chnl_1
#define SPI_DMA_IO_UPDATE_RISE_XBAR_INPUT    kXBARA1_InputPitTrigger1
#define SPI_DMA_IO_UPDATE_RISE_XBAR_OUTPUT   kXBARA1_OutputDmaChMuxReq31
#define SPI_DMA_IO_UPDATE_RISE_DMAMUX_SRC    kDmaRequestMuxXBAR1Request1
#define SPI_DMA_IO_UPDATE_FALL_PIT_CHANNEL   kPIT_Chnl_2
#define SPI_DMA_IO_UPDATE_FALL_XBAR_INPUT    kXBARA1_InputPitTrigger2
#define SPI_DMA_IO_UPDATE_FALL_XBAR_OUTPUT   kXBARA1_OutputDmaChMuxReq94
#define SPI_DMA_IO_UPDATE_FALL_DMAMUX_SRC    kDmaRequestMuxXBAR1Request2

// D15 = SoC pad GPIO_AD_B1_03 = GPIO1 bit 19 in plain-GPIO alt-function mode (confirmed
// via IOMUXC_GPIO_AD_B1_03_GPIO1_IO19, sdk/devices/MIMXRT1062/drivers/fsl_iomuxc.h).
#define SPI_DMA_IO_UPDATE_GPIO_BASE  GPIO1
#define SPI_DMA_IO_UPDATE_GPIO_BIT   (19u)

// Ring buffer size: two equal halves, refilled one half at a time while the DMA engine
// drains the other -- same double-buffering shape as machine_i2s.c's SIZEOF_DMA_BUFFER_
// IN_BYTES/feed_dma() pattern, sized in frames rather than assumed a fixed byte count
// since frame_bytes is caller-specified (5 bytes for an AD9952/9954-style FTW0 write, 8
// for an AD9910 Profile 0 write, etc.).
#define SPI_DMA_FRAMES_PER_HALF (64)

typedef struct _machine_spi_obj_t {
    mp_obj_base_t base;
    uint8_t spi_id;
    uint8_t mode;
    uint8_t spi_hw_id;
    bool transfer_busy;
    LPSPI_Type *spi_inst;
    lpspi_master_config_t *master_config;

    // --- periodic DMA extension state; all zero/NULL unless dma_periodic_start() has
    // been called on this object. See the module-level comment block above.
    bool dma_periodic_active;
    size_t dma_frame_bytes;
    uint8_t *dma_buffer;                 // 2 * SPI_DMA_FRAMES_PER_HALF * dma_frame_bytes,
                                          // allocated at dma_periodic_start() time
    uint8_t *dma_buffer_dcache_aligned;
    int dma_channel;
    edma_handle_t dma_edmaHandle;
    edma_tcd_t *dma_edmaTcd;
    mp_obj_t dma_refill_callback;         // called via mp_sched_schedule(cb, half_index)

    // --- I/O_UPDATE rise/fall eDMA channels (GPIO1 DR_SET/DR_CLEAR toggle via PIT
    // channels 1/2 + XBARA1, not TMR3 -- see the module-level comment block). Only
    // valid while dma_periodic_active is true, same as the fields above.
    int dma_io_update_set_channel;
    int dma_io_update_clear_channel;
    edma_handle_t dma_io_update_set_edmaHandle;
    edma_handle_t dma_io_update_clear_edmaHandle;
} machine_spi_obj_t;

typedef struct _iomux_table_t {
    uint32_t muxRegister;
    uint32_t muxMode;
    uint32_t inputRegister;
    uint32_t inputDaisy;
    uint32_t configRegister;
} iomux_table_t;

