A622266/micropython/ports/mimxrt/machine_spi.c
// spi.dma_periodic_start(frame_bytes, rate_hz, refill_callback, io_update_duty_u16=0,
//                         io_update_phase_ticks=0)
//
// Starts a PIT/eDMA-driven periodic transfer of `frame_bytes`-sized frames from an
// internal double-buffer into this SPI object's LPSPI TDR register at `rate_hz`, and an
// I/O_UPDATE pulse on pin D15 at the same rate -- generated by two MORE PIT channels
// (sharing the same PERCLK root as the SPI-triggering channel, see the module comment)
// driving GPIO1 directly via eDMA, not TMR3's PWM.
// `refill_callback(half)` is scheduled (via mp_sched_schedule, i.e. run on the main
// thread, not from IRQ context) each time a half-buffer has just been drained and needs
// fresh frames written into it via dma_periodic_write(half, buf).
//
// `io_update_duty_u16` is the I/O_UPDATE pulse width as a fraction of the full period
// (0..65535 maps to 0..rate_hz's period); 0 means "no I/O_UPDATE pulse is generated,"
// i.e. this call alone is NOT sufficient for a working DDS update path. `io_update_
// phase_ticks` is the rising-edge delay in PIT ticks from the same start reference the
// SPI-triggering channel counts from; 0 picks a default (80% of the period) rather than
// a caller-required value, but that default is NOT bench-derived -- see the module
// comment's open-items list. The clock-DOMAIN drift problem this design replaces (PIT
// vs. TMR3/QTMR, confirmed on the bench 2026-09-06) is fixed by construction now: only
// the exact tick counts remain a bench-tuning question, not whether the two stay locked.
static mp_obj_t machine_spi_dma_periodic_start(size_t n_args, const mp_obj_t *args) {
    machine_spi_obj_t *self = MP_OBJ_TO_PTR(args[0]);
    mp_int_t frame_bytes = mp_obj_get_int(args[1]);
    mp_int_t rate_hz = mp_obj_get_int(args[2]);
    mp_obj_t refill_callback = args[3];
    mp_int_t io_update_duty_u16 = (n_args > 4) ? mp_obj_get_int(args[4]) : 0;
    mp_int_t io_update_phase_ticks = (n_args > 5) ? mp_obj_get_int(args[5]) : 0;

    if (self->dma_periodic_active) {
        mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("dma_periodic already active"));
    }
    if (frame_bytes <= 0 || frame_bytes > 16) {
        mp_raise_ValueError(MP_ERROR_TEXT("frame_bytes out of range"));
    }

    self->dma_frame_bytes = (size_t)frame_bytes;
    size_t half_bytes = SPI_DMA_FRAMES_PER_HALF * self->dma_frame_bytes;
    size_t total_bytes = 2 * half_bytes;

    // +0x1f for D-cache-line alignment slack, same as machine_i2s.c's dma_buffer field;
    // AT_NONCACHEABLE_SECTION_ALIGN is not used here because size is only known at this
    // point (frame_bytes is caller-specified), unlike the fixed-size TCD above -- this
    // buffer instead needs an explicit cache-maintenance call before each DMA-visible
    // write -- confirmed necessary by bench test (2026-09-06): a frequency-sweep test
    // wrote genuinely changing content via dma_periodic_write() on every refill (verified
    // via the Teensy's own debug log), but the DDS output never changed, stuck at
    // whatever the very first write happened to leave in RAM -- exactly the D-cache
    // staleness this TODO predicted (CPU writes land in cache, DMA reads RAM directly,
    // never sees the update without an explicit clean).
    self->dma_buffer = m_new(uint8_t, total_bytes + 0x1f);
    self->dma_buffer_dcache_aligned = (uint8_t *)(((uint32_t)self->dma_buffer + 0x1f) & ~0x1f);
    memset(self->dma_buffer_dcache_aligned, 0, total_bytes);
    DCACHE_CleanByRange((uint32_t)self->dma_buffer_dcache_aligned, (uint32_t)total_bytes);

    self->dma_refill_callback = refill_callback;

    // --- PIT channel 0: unconditional periodic trigger pulse. Its DOWNSTREAM routing
    // (DMAMUX's dedicated periodic-trigger path, not XBARA1 -- see SPI_DMA_DMAMUX_
    // CHANNEL's own comment above) is configured further below, after DMAMUX/eDMA are
    // initialized.
    pit_config_t pit_config;
    PIT_GetDefaultConfig(&pit_config);
    PIT_Init(PIT, &pit_config);
    uint32_t perclk_hz = CLOCK_GetPerClkFreq();
    uint32_t pit_ticks = perclk_hz / (uint32_t)rate_hz;
    if (pit_ticks == 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("rate_hz too high to represent on PIT"));
    }
    PIT_SetTimerPeriod(PIT, SPI_DMA_PIT_CHANNEL, pit_ticks);

    // XBARA1 is still needed below for the I/O_UPDATE rise/fall channels (unrelated to
    // this revision -- those were already proven correct on the bench and are untouched
    // here); the SPI trigger itself no longer uses it.
    XBARA_Init(XBARA1);
    xbara_control_config_t xbar_ctrl_config = {
        .activeEdge = kXBARA_EdgeRising,
        .requestType = kXBARA_RequestDMAEnable,
    };

    // DMAMUX and eDMA (DMA0) must both be initialized before ANY channel is touched --
    // moved up here (both idempotent, DMAMUX_Init() resets/enables the whole module and
    // dma_init() itself is internally guarded against being called twice) because the
    // I/O_UPDATE block below now also allocates/configures two eDMA channels, and this
    // was originally placed further down, after that block -- a real bug found on the
    // bench (2026-09-06 revision 2): with initialization still below, the I/O_UPDATE
    // channels' EDMA_CreateHandle()/DMAMUX_SetSource() calls ran against an
    // uninitialized DMAMUX/DMA0, hanging the board before dma_periodic_start() could
    // ever return.
    dma_init();
    DMAMUX_Init(DMAMUX);

    // --- SPI trigger: DMAMUX channel 0's periodic-trigger feature, gating LPSPI4's own
    // TX-FIFO-not-full DMA request against PIT channel 0 -- see SPI_DMA_DMAMUX_CHANNEL's
    // own comment above for why (i.MX RT1060 RM section 5.4.1's own documented
    // mechanism, replacing the XBARA1-routed fake-request version that bench-testing
    // found fires multiple frames per trigger once frame_bytes > 1). DMAMUX channel 0 is
    // NOT drawn from allocate_dma_channel()'s general pool -- it and channels 1-3 are
    // permanently reserved there specifically because only these first 4 channels have
    // this hardware feature, and the RM's own fixed table (eDMA channel N <-> PIT
    // channel N) requires channel 0 to pair with PIT channel 0, which is already
    // SPI_DMA_PIT_CHANNEL above.
    DMAMUX_SetSource(DMAMUX, SPI_DMA_DMAMUX_CHANNEL, SPI_DMA_LPSPI4_TX_DMAMUX_SRC);
    DMAMUX_EnableChannel(DMAMUX, SPI_DMA_DMAMUX_CHANNEL);
    DMAMUX_EnablePeriodTrigger(DMAMUX, SPI_DMA_DMAMUX_CHANNEL);
    LPSPI_EnableDMA(self->spi_inst, kLPSPI_TxDmaEnable);

    // --- I/O_UPDATE on pin D15, via PIT channels 1/2 + XBARA1 + two small self-linked
    // eDMA channels toggling GPIO1 directly (DR_SET/DR_CLEAR). See the module-level
    // comment for why this replaced TMR3's PWM (a real, bench-confirmed clock-domain
    // drift between PIT/PERCLK and QTMR/IPG_CLK) and how the fixed phase offset below is
    // created. io_update_duty_u16 == 0 keeps the previous "no I/O_UPDATE pulse
    // generated" behavior -- this call alone still isn't sufficient for a working DDS
    // update path without it.
    if (io_update_duty_u16 > 0) {
        // Both offsets are PIT ticks counted from the same t=0 that SPI_DMA_PIT_CHANNEL
        // itself starts from (its own PIT_StartTimer() call is below, right after these
        // channels' own). Default phase, if the caller passes 0: land the rising edge
        // 80% through the period, leaving margin both for the SPI frame to finish
        // clocking out ahead of it and for the pulse width behind it -- a starting
        // point, NOT a bench-derived value; see the module comment's open-items list.
        uint32_t phase_ticks = (io_update_phase_ticks > 0)
            ? (uint32_t)io_update_phase_ticks
            : (pit_ticks * 4) / 5;
        uint32_t pulse_width_ticks = (uint32_t)(((uint64_t)pit_ticks * (uint32_t)io_update_duty_u16) / 65536);
        if (pulse_width_ticks < 1) {
            pulse_width_ticks = 1;
        }
        if (phase_ticks < 1) {
            phase_ticks = 1;
        }
        if (phase_ticks + pulse_width_ticks >= pit_ticks) {
            if (phase_ticks + 1 >= pit_ticks) {
                mp_raise_ValueError(MP_ERROR_TEXT("io_update_phase_ticks leaves no room in the period"));
            }
            pulse_width_ticks = pit_ticks - phase_ticks - 1;
        }

        // D15 as plain GPIO output (ALT5, GPIO1 bit 19) instead of QTIMER3_TIMER3 -- see
        // the module comment for the pin-mux fact this depends on. Same
        // SetPinMux+SetPinConfig pairing as lpspi_set_iomux() (a real bug -- a missing
        // SetPinConfig call -- was found and fixed on the earlier TMR3-based version of
        // this, and this keeps that fix's pairing rather than repeating the gap).
        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_03_GPIO1_IO19, 0U);
        IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_03_GPIO1_IO19,
            pin_generate_config(PIN_PULL_UP_100K, PIN_MODE_OUT, DEFAULT_SPI_DRIVE, 0x401F82F8U));
        SPI_DMA_IO_UPDATE_GPIO_BASE->GDIR |= (1u << SPI_DMA_IO_UPDATE_GPIO_BIT);
        SPI_DMA_IO_UPDATE_GPIO_BASE->DR_CLEAR = (1u << SPI_DMA_IO_UPDATE_GPIO_BIT); // start low
        spi_dma_io_update_gpio_bit_mask = (1u << SPI_DMA_IO_UPDATE_GPIO_BIT);

