A622266/micropython/ports/mimxrt/machine_spi.c
        // --- PIT channels 1 (rise) and 2 (fall): one-shot short LDVAL, started, then
        // immediately rewritten to the full period -- see the module comment for why
        // this creates a fixed, driftless offset instead of a running calibration.
        PIT_SetTimerPeriod(PIT, SPI_DMA_IO_UPDATE_RISE_PIT_CHANNEL, phase_ticks);
        XBARA_SetSignalsConnection(XBARA1, SPI_DMA_IO_UPDATE_RISE_XBAR_INPUT, SPI_DMA_IO_UPDATE_RISE_XBAR_OUTPUT);
        XBARA_SetOutputSignalConfig(XBARA1, SPI_DMA_IO_UPDATE_RISE_XBAR_OUTPUT, &xbar_ctrl_config);

        PIT_SetTimerPeriod(PIT, SPI_DMA_IO_UPDATE_FALL_PIT_CHANNEL, phase_ticks + pulse_width_ticks);
        XBARA_SetSignalsConnection(XBARA1, SPI_DMA_IO_UPDATE_FALL_XBAR_INPUT, SPI_DMA_IO_UPDATE_FALL_XBAR_OUTPUT);
        XBARA_SetOutputSignalConfig(XBARA1, SPI_DMA_IO_UPDATE_FALL_XBAR_OUTPUT, &xbar_ctrl_config);

        // --- Two small eDMA channels: each a single fixed 4-byte write of the same
        // constant bitmask into GPIO1's DR_SET (rise) or DR_CLEAR (fall), self-linked so
        // they keep re-arming forever with no CPU/interrupt involvement -- fire-and-
        // forget, no EDMA_SetCallback, nothing needs to run in software when these fire.
        self->dma_io_update_set_channel = allocate_dma_channel();
        self->dma_io_update_clear_channel = allocate_dma_channel();
        if (self->dma_io_update_set_channel < 0 || self->dma_io_update_clear_channel < 0) {
            mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("no DMA channel available for I/O_UPDATE"));
        }
        DMAMUX_SetSource(DMAMUX, self->dma_io_update_set_channel, SPI_DMA_IO_UPDATE_RISE_DMAMUX_SRC);
        DMAMUX_EnableChannel(DMAMUX, self->dma_io_update_set_channel);
        DMAMUX_SetSource(DMAMUX, self->dma_io_update_clear_channel, SPI_DMA_IO_UPDATE_FALL_DMAMUX_SRC);
        DMAMUX_EnableChannel(DMAMUX, self->dma_io_update_clear_channel);

        EDMA_CreateHandle(&self->dma_io_update_set_edmaHandle, DMA0, self->dma_io_update_set_channel);
        EDMA_ResetChannel(DMA0, self->dma_io_update_set_channel);
        edma_transfer_config_t io_update_set_config;
        EDMA_PrepareTransfer(&io_update_set_config,
            &spi_dma_io_update_gpio_bit_mask, 4,
            (void *)&SPI_DMA_IO_UPDATE_GPIO_BASE->DR_SET, 4,
            4, 4, kEDMA_MemoryToPeripheral);
        memset(&spi_dma_io_update_set_tcd, 0, sizeof(edma_tcd_t));
        EDMA_TcdSetTransferConfig(&spi_dma_io_update_set_tcd, &io_update_set_config, &spi_dma_io_update_set_tcd);
        EDMA_InstallTCD(DMA0, self->dma_io_update_set_channel, &spi_dma_io_update_set_tcd);
        EDMA_StartTransfer(&self->dma_io_update_set_edmaHandle);

        EDMA_CreateHandle(&self->dma_io_update_clear_edmaHandle, DMA0, self->dma_io_update_clear_channel);
        EDMA_ResetChannel(DMA0, self->dma_io_update_clear_channel);
        edma_transfer_config_t io_update_clear_config;
        EDMA_PrepareTransfer(&io_update_clear_config,
            &spi_dma_io_update_gpio_bit_mask, 4,
            (void *)&SPI_DMA_IO_UPDATE_GPIO_BASE->DR_CLEAR, 4,
            4, 4, kEDMA_MemoryToPeripheral);
        memset(&spi_dma_io_update_clear_tcd, 0, sizeof(edma_tcd_t));
        EDMA_TcdSetTransferConfig(&spi_dma_io_update_clear_tcd, &io_update_clear_config, &spi_dma_io_update_clear_tcd);
        EDMA_InstallTCD(DMA0, self->dma_io_update_clear_channel, &spi_dma_io_update_clear_tcd);
        EDMA_StartTransfer(&self->dma_io_update_clear_edmaHandle);

        PIT_StartTimer(PIT, SPI_DMA_IO_UPDATE_RISE_PIT_CHANNEL);
        PIT_StartTimer(PIT, SPI_DMA_IO_UPDATE_FALL_PIT_CHANNEL);
        // Rewrite both LDVALs to the real period now that each channel has already
        // latched its short one-shot value into CVAL at start -- per fsl_pit.h, this
        // only takes effect on the SECOND and later reloads (see the module comment),
        // leaving both channels offset from SPI_DMA_PIT_CHANNEL by phase_ticks /
        // phase_ticks+pulse_width_ticks forever, with zero drift between them.
        PIT_SetTimerPeriod(PIT, SPI_DMA_IO_UPDATE_RISE_PIT_CHANNEL, pit_ticks);
        PIT_SetTimerPeriod(PIT, SPI_DMA_IO_UPDATE_FALL_PIT_CHANNEL, pit_ticks);
    } else {
        self->dma_io_update_set_channel = -1;
        self->dma_io_update_clear_channel = -1;
    }

    // --- LPSPI frame-size fixup: a single AD9910/9952/9954 register write is one
    // instruction byte + N payload bytes inside ONE continuous chip-select-low window
    // (the datasheet's own serial-port timing diagram), not N+1 separate one-byte
    // transactions. Left at whatever FRAMESZ a normal machine.SPI.write() call last
    // configured (LPSPI defaults effectively to one CS pulse per 8 bits), the DMA path
    // below would toggle PCS after every single byte instead of once per whole frame --
    // almost certainly misinterpreted by the DDS as N+1 separate short writes rather
    // than one real register write. Fixed by widening just the FRAMESZ field so hardware
    // holds PCS low across the whole frame_bytes*8-bit frame, auto-toggling it only
    // between frames.
    //
    // Deliberately a read-modify-write of TCR's existing value, not a from-scratch
    // reconstruction: TCR also carries CPOL/CPHA/PRESCALE/PCS-select/byte-swap, and
    // LPSPI_MasterInit() does not appear to fully populate TCR itself (those fields seem
    // to only get set for real when a transfer actually runs) -- so this call has a real
    // PRECONDITION: at least one ordinary spi.write()/write_readinto() must already have
    // succeeded on this object before dma_periodic_start() is called, so TCR already
    // holds this project's correct working CPOL/CPHA/byte-order configuration from that
    // call, and this code only widens FRAMESZ on top of it rather than guessing those
    // other fields from scratch (guessing PRESCALE's encoding or BYSW independently was
    // judged a worse risk than requiring this precondition). NOT bench-verified that this
    // read-modify-write approach actually produces correct multi-byte bit ordering on the
    // wire -- see the module comment's open-items list; capture with the ADALM2000 and
    // compare against a known-good blocking-mode write of the same register before
    // trusting this.
    uint32_t frame_bits = (uint32_t)self->dma_frame_bytes * 8;
    self->spi_inst->TCR = (self->spi_inst->TCR & ~LPSPI_TCR_FRAMESZ_MASK) | LPSPI_TCR_FRAMESZ(frame_bits - 1);

    // --- eDMA: PIT-triggered (via DMAMUX's periodic-trigger gate, see above), ring
    // buffer -> LPSPI TDR, self-linked TCD for continuous circular operation (same
    // construct machine_i2s.c uses). self->dma_channel is the FIXED
    // SPI_DMA_DMAMUX_CHANNEL configured above, not drawn from allocate_dma_channel() --
    // DMAMUX_Init()/dma_init() already ran above too, not repeated here.
    self->dma_channel = SPI_DMA_DMAMUX_CHANNEL;

    EDMA_CreateHandle(&self->dma_edmaHandle, DMA0, self->dma_channel);
    EDMA_SetCallback(&self->dma_edmaHandle, edma_spi_periodic_callback, self);
    EDMA_ResetChannel(DMA0, self->dma_channel);
    self->dma_edmaTcd = &spi_dma_tcd;

    // Per-beat transfer width MUST be a real eDMA SSIZE/DSIZE encoding (1/2/4/8/16/32
    // bytes) -- dma_frame_bytes (e.g. 9 for an AD9910 write) is NOT a valid width and an
    // earlier version of this patch wrongly passed it as one. Fixed: beats are always
    // 1 byte wide; dma_frame_bytes instead sets the MINOR LOOP byte count (how many
    // 1-byte beats fire back-to-back per single PIT-sourced DMA request) -- this is the
    // standard eDMA minor-loop/major-loop split, not a workaround.
    edma_transfer_config_t transferConfig;
    EDMA_PrepareTransfer(&transferConfig,
        self->dma_buffer_dcache_aligned, 1,
        (void *)&self->spi_inst->TDR, 1,
        (uint32_t)self->dma_frame_bytes,     // minor loop: one whole frame per QTMR tick
        (uint32_t)total_bytes,               // major loop: whole ring buffer
        kEDMA_MemoryToPeripheral);
    memset(self->dma_edmaTcd, 0, sizeof(edma_tcd_t));
    EDMA_TcdSetTransferConfig(self->dma_edmaTcd, &transferConfig, self->dma_edmaTcd);
    EDMA_TcdEnableInterrupts(self->dma_edmaTcd, kEDMA_MajorInterruptEnable | kEDMA_HalfInterruptEnable);
    EDMA_InstallTCD(DMA0, self->dma_channel, self->dma_edmaTcd);
    EDMA_StartTransfer(&self->dma_edmaHandle);

    PIT_StartTimer(PIT, SPI_DMA_PIT_CHANNEL);

    self->dma_periodic_active = true;
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_spi_dma_periodic_start_obj, 4, 6, machine_spi_dma_periodic_start);

// spi.dma_periodic_write(half, buf) -- copy buf (must be exactly SPI_DMA_FRAMES_PER_HALF
// * frame_bytes long) into the specified half (0=bottom, 1=top) of the internal ring
// buffer. Intended to be called from the refill_callback passed to
// dma_periodic_start(), using the `half` value that callback was invoked with.
static mp_obj_t machine_spi_dma_periodic_write(mp_obj_t self_in, mp_obj_t half_in, mp_obj_t buf_in) {
    machine_spi_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_int_t half = mp_obj_get_int(half_in);
    if (!self->dma_periodic_active) {
        mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("dma_periodic not active"));
    }
    mp_buffer_info_t buf;
    mp_get_buffer_raise(buf_in, &buf, MP_BUFFER_READ);
    size_t half_bytes = SPI_DMA_FRAMES_PER_HALF * self->dma_frame_bytes;
    if (buf.len != half_bytes) {
        mp_raise_ValueError(MP_ERROR_TEXT("buffer wrong length for one half"));
    }
    uint8_t *dest = self->dma_buffer_dcache_aligned + (half ? half_bytes : 0);
    memcpy(dest, buf.buf, half_bytes);
    // Confirmed necessary by bench test (2026-09-06) -- see dma_periodic_start()'s own
    // comment. Without this, DMA silently keeps reading whatever stale content was in
    // RAM before this call, ignoring every refill.
    DCACHE_CleanByRange((uint32_t)dest, (uint32_t)half_bytes);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_3(machine_spi_dma_periodic_write_obj, machine_spi_dma_periodic_write);

// Diagnostic-only (2026-09-06): see spi_dma_isr_count's own comment above.
static mp_obj_t machine_spi_dma_periodic_isr_count(mp_obj_t self_in) {
    (void)self_in;
    return mp_obj_new_int_from_uint(spi_dma_isr_count);
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_spi_dma_periodic_isr_count_obj, machine_spi_dma_periodic_isr_count);

static mp_obj_t machine_spi_dma_periodic_stop(mp_obj_t self_in) {
    machine_spi_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (!self->dma_periodic_active) {
        return mp_const_none;
    }
    EDMA_AbortTransfer(&self->dma_edmaHandle);
    // self->dma_channel is the FIXED SPI_DMA_DMAMUX_CHANNEL, never drawn from
    // allocate_dma_channel()'s pool -- do NOT free_dma_channel() it, that pool doesn't
    // own it and freeing it here would let some unrelated caller's allocate_dma_channel()
    // hand it out later, corrupting this dedicated feature on the next dma_periodic_
    // start() call. Just disable the DMAMUX trigger and LPSPI's own DMA request instead.
    DMAMUX_DisablePeriodTrigger(DMAMUX, SPI_DMA_DMAMUX_CHANNEL);
    DMAMUX_DisableChannel(DMAMUX, SPI_DMA_DMAMUX_CHANNEL);
    LPSPI_DisableDMA(self->spi_inst, kLPSPI_TxDmaEnable);
    PIT_StopTimer(PIT, SPI_DMA_PIT_CHANNEL);
    if (self->dma_io_update_set_channel >= 0) {
        EDMA_AbortTransfer(&self->dma_io_update_set_edmaHandle);
        free_dma_channel(self->dma_io_update_set_channel);
        self->dma_io_update_set_channel = -1;
    }
    if (self->dma_io_update_clear_channel >= 0) {
        EDMA_AbortTransfer(&self->dma_io_update_clear_edmaHandle);
        free_dma_channel(self->dma_io_update_clear_channel);
        self->dma_io_update_clear_channel = -1;
    }
    PIT_StopTimer(PIT, SPI_DMA_IO_UPDATE_RISE_PIT_CHANNEL);
    PIT_StopTimer(PIT, SPI_DMA_IO_UPDATE_FALL_PIT_CHANNEL);
    self->dma_periodic_active = false;
    self->dma_refill_callback = MP_OBJ_NULL;
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_spi_dma_periodic_stop_obj, machine_spi_dma_periodic_stop);

static void machine_spi_deinit_hw(mp_obj_base_t *self_in) {
    machine_spi_dma_periodic_stop(MP_OBJ_FROM_PTR(self_in));
}

